# House Sales in King County, USA

## Here is a brief description of the database

**Source**: https://www.kaggle.com/datasets/harlfoxem/housesalesprediction

This database contains prices for homes sold in King County, USA.
This dataset contains house sale prices for King County, which includes Seattle. is a sample of on-site sales between May 2014 and May 2015

* **id**: ID for the house

* **date**: Date the house was sold

* **price**: Price at which the house was sold

* **bedrooms**: Number of bedrooms the house has

* **bathrooms**: Number of bathrooms the house has

* **sqft_living**: Area within the property-measured in square feet

* **sqft_lot**: Lot area - measured in square feet

* **floors**: Number of floors

* **waterfront**: Indicates whether or not the property has a sea view

* **view**: Index from 0 to 4 that rates how good the view of the property was

* **condition**: Contains an index from 1 to 5 on the condition of the property

* **grade**: Contains an index of 1 to 13: a) 1-3->the property has a low level of construction and design; b) 7->has a medium level of construction and design; c) 11-13->has a high level of construction and design quality.

* **sqft_above**: Reports the area of the interior living space that is above ground level

* **sqft_basement**: Contains the basement area

* **yr_built**: Contains the construction date of the property

* **yr_renovated**: Contains the date of the last renovation carried out on the property

* **zipcode**: Contains zipcode

* **lat**: Latitude

* **long**: Longitude

* **sqft_living15**: Contains the average area within the properties of the 15 nearest neighbors-measured in square feet

* **sqft_lot15**: Contains the average area of the 15 nearest neighbors' lots-measured in square feet

In [1]:
%config IPCompleter.greedy=True

In [2]:
#Version python language
from platform import python_version
print('Current Version:', python_version())

Current Version: 3.9.7

In [3]:
!pip install -q -U watermark

In [4]:
!pip install -q ipython-sql

In [5]:
#To creatin messing value map
!pip install -q missingno

In [6]:
#Allows application of categorization to variables
!pip install -q category_encoders

In [7]:
#High-end graphics creation
!pip install -q plotly

In [8]:
#Statistic package
!pip install -q researchpy

In [12]:
#Imports

#Data manipulation
import pandas as pd
import numpy as np

#For using sqlite database
#import sqlite3 as sql3

#Visualization
import matplotlib.pyplot as plt
import seaborn as sns
import plotly.express as px
import plotly.graph_objects as go
from plotly.subplots import make_subplots
import missingno

#Statistic
import scipy
from scipy.stats import normaltest
from scipy.stats import chi2_contingency
import researchpy as rp
    
#Attribute engineering
from sklearn.pipeline import Pipeline
from sklearn.impute import SimpleImputer
from sklearn.preprocessing import OneHotEncoder, LabelEncoder, OrdinalEncoder
from sklearn.compose import ColumnTransformer
import category_encoders as ce

#Ignore Warning; commands to ignore the warnings that come with packages
import sys
import warnings
if not sys.warnoptions:
    warnings.simplefilter("ignore")

In [13]:
#Versions of packages used in this jupyter notebook
%reload_ext watermark
%watermark -a "Alexandre Palma Gonçalves" --iversions

Author: Alexandre Palma Gonçalves

sys              : 3.9.7 (default, Sep 16 2021, 16:59:28) [MSC v.1916 64 bit (AMD64)]
missingno        : 0.5.1
pandas           : 1.3.4
researchpy       : 0.3.2
matplotlib       : 3.4.3
plotly           : 5.6.0
numpy            : 1.20.3
seaborn          : 0.11.2
scipy            : 1.7.1
category_encoders: 2.4.0

In [15]:
#Load the dataset
df=pd.read_csv('kc_house_data.csv')

## Preliminary Data Analysis

In [16]:
df.head()

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
0,7129300520,20141013T000000,221900.0,3,1.00,1180,5650,1.0,0,0,...,7,1180,0,1955,0,98178,47.5112,-122.257,1340,5650
1,6414100192,20141209T000000,538000.0,3,2.25,2570,7242,2.0,0,0,...,7,2170,400,1951,1991,98125,47.7210,-122.319,1690,7639
2,5631500400,20150225T000000,180000.0,2,1.00,770,10000,1.0,0,0,...,6,770,0,1933,0,98028,47.7379,-122.233,2720,8062
3,2487200875,20141209T000000,604000.0,4,3.00,1960,5000,1.0,0,0,...,7,1050,910,1965,0,98136,47.5208,-122.393,1360,5000
4,1954400510,20150218T000000,510000.0,3,2.00,1680,8080,1.0,0,0,...,8,1680,0,1987,0,98074,47.6168,-122.045,1800,7503

In [24]:
df.tail()

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
21608,263000018,20140521T000000,360000.0,3,2.50,1530,1131,3.0,0,0,...,8,1530,0,2009,0,98103,47.6993,-122.346,1530,1509
21609,6600060120,20150223T000000,400000.0,4,2.50,2310,5813,2.0,0,0,...,8,2310,0,2014,0,98146,47.5107,-122.362,1830,7200
21610,1523300141,20140623T000000,402101.0,2,0.75,1020,1350,2.0,0,0,...,7,1020,0,2009,0,98144,47.5944,-122.299,1020,2007
21611,291310100,20150116T000000,400000.0,3,2.50,1600,2388,2.0,0,0,...,8,1600,0,2004,0,98027,47.5345,-122.069,1410,1287
21612,1523300157,20141015T000000,325000.0,2,0.75,1020,1076,2.0,0,0,...,7,1020,0,2008,0,98144,47.5941,-122.299,1020,1357

In [21]:
#Info
#other option: df.dtypes
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21613 entries, 0 to 21612
Data columns (total 21 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             21613 non-null  int64
 1   date           21613 non-null  object
 2   price          21613 non-null  float64
 3   bedrooms       21613 non-null  int64
 4   bathrooms      21613 non-null  float64
 5   sqft_living    21613 non-null  int64
 6   sqft_lot       21613 non-null  int64
 7   floors         21613 non-null  float64
 8   waterfront     21613 non-null  int64
 9   view           21613 non-null  int64
 10  condition      21613 non-null  int64
 11  grade          21613 non-null  int64
 12  sqft_above     21613 non-null  int64
 13  sqft_basement  21613 non-null  int64
 14  yr_built       21613 non-null  int64
 15  yr_renovated   21613 non-null  int64
 16  zipcode        21613 non-null  int64
 17  lat            21613 non-null  float64
 18  long           21613 non-null  float64
 19  sqft_living15  21613 non-null  int64
 20  sqft_lot15     21613 non-null  int64
dtypes: float64(5), int64(15), object(1)
memory usage: 3.5+ MB

In [23]:
#Number of observationsper variable
df.count()

id               21613
date             21613
price            21613
bedrooms         21613
bathrooms        21613
sqft_living      21613
sqft_lot         21613
floors           21613
waterfront       21613
view             21613
condition        21613
grade            21613
sqft_above       21613
sqft_basement    21613
yr_built         21613
yr_renovated     21613
zipcode          21613
lat              21613
long             21613
sqft_living15    21613
sqft_lot15       21613
dtype: int64

In [28]:
#Checking for duplicate ids
df['id'].nunique('id')

21436

In [33]:
#Number of repeated ids
(df['id'].count()) - (df['id'].nunique('id'))

177

In [35]:
#List of repeated ids
df['id'].value_counts()

795000620     3
8651510380    2
2568300045    2
9353300600    2
4139480200    2
             ..
2767603649    1
1446403617    1
5602000275    1
1786200010    1
1523300157    1
Name: id, Length: 21436, dtype: int64

In [38]:
#Creating variable that contains the year the house was sold
df['year']=df['date'].str[:4]
df['year']=df['year'].astype('int64')

In [59]:
#Creating a categorical variable based on the age of the property
df['age_yr']=df['year']-df['yr_built']

df['property_age_classification']=np.where(df['age_yr']>=30, 'Old',
               np.where((df['age_yr']>=10) & (df['age_yr']<30), 'Intermediate Age',
               np.where(df['age_yr']<10, 'New','')))

df['property_age_classification']=pd.Categorical(df['property_age_classification'], categories=["Old", "Intermediate Age", "New"], ordered=True)

In [64]:
#Creation of a category for the notes assigned to the architecture of the property
df['architecture']=np.where(df['grade']<=5, 'Low Grade',
               np.where((df['grade']>5) & (df['grade']<=10), 'Average Grade',
               np.where(df['grade']>10, 'High Grade','')))


df['architecture']=pd.Categorical(df['architecture'], categories=['Low Grade', 'Average Grade', 'High Grade'], ordered=True)

## Qualitative Variables